xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
    // Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function to write to the LED characterestic of all connected clients.
 *
 * @details Based on if the button is pressed or released, we write a high or low LED status to
 *          the server.
 *
 * @param[in] button_action The button action (press/release).
 *            Determines if the LEDs of the servers will be ON or OFF.
 *
 * @return NRF_SUCCESS on success, else the error code from ble_lbs_led_status_send.
 */
//static uint32_t led_status_send_to_all(uint8_t button_action)
//{
//    uint32_t err_code;
//
//    for (uint32_t i = 0; i< CENTRAL_LINK_COUNT; i++)
//    {
//        err_code = ble_lbs_led_status_send(&m_ble_lbs_c[i], button_action);
//        if (err_code != NRF_SUCCESS &&
//            err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
//            err_code != NRF_ERROR_INVALID_STATE)
//        {
//            return err_code;
//        }
//    }
//        return NRF_SUCCESS;
//}


/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
//static void button_event_handler(uint8_t pin_no, uint8_t button_action)
//{
//    uint32_t err_code;
//
//    switch (pin_no)
//    {
//        case LEDBUTTON_BUTTON_PIN:
//            err_code = led_status_send_to_all(button_action);
//            if (err_code == NRF_SUCCESS)
//            {
//                NRF_LOG_INFO("LBS write LED state %d\r\n", button_action);
//            }
//            break;
//
//        default:
//            APP_ERROR_HANDLER(pin_no);
//            break;
//    }
//}


/**@brief Function for initializing the button handler module.
 */
//static void buttons_init(void)
//{
//    uint32_t err_code;
//
//   //The array must be static because a pointer to it will be saved in the button handler module.
//    static app_button_cfg_t buttons[] =
//    {
//        {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler}
//    };
//
//    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
//                               BUTTON_DETECTION_DELAY);
//    APP_ERROR_CHECK(err_code);
//}


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    //NRF_LOG_INFO("call to ble_lbs_on_db_disc_evt for instance %d and link 0x%x!\r\n",
	NRF_LOG_INFO("call to  instance %d and link 0x%x!\r\n",
                    p_evt->conn_handle,
                    p_evt->conn_handle);
    
	
	NRF_LOG_INFO("--->1\n");
	//ble_lbs_on_db_disc_evt(&m_ble_lbs_c[p_evt->conn_handle], p_evt);
	ble_nus_c_on_db_disc_evt(&m_ble_nus_c[p_evt->conn_handle], p_evt);
	NRF_LOG_INFO("--->2\n");
}


/** @brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}



/** @brief Function to sleep until a BLE event is received by the application.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


int main(void)
{
    ret_code_t err_code;

    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("Multilink BLE UART Example v.11\r\n");
//    leds_init();
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
//    buttons_init();
		uart_init();
    ble_stack_init();

    db_discovery_init();
//    lbs_c_init();
	nus_c_init();

    // Start scanning for peripherals and initiate connection to devices which
    // advertise.
    scan_start();

    // Turn on the LED to signal scanning.
//    bsp_board_led_on(CENTRAL_SCANNING_LED);

    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            // Wait for BLE events.
            power_manage();
        }
    }
}
